package biss.ctf.back.DB

import biss.ctf.back.entities.MazeLevelEntity

val MAZE_LEVELS_DB = arrayOf(
    MazeLevelEntity(
        "(מתורגם מערבית) היי שלום, עכשיו יש מבוך זיפים, כדי להיכנס למידע המודיעיני המוצפן הצפנו אותו בזיפים. אתם כמובן זוכרים את המסלול ואת הסיסמאות, במקרה של שכחה (קורה לכולנו כמובן), החבאנו את הסיסמאות והשארנו שאלות רמזיים כדי לגלות את התשובות. ישראלים לא יצליחו לפתור, הצלחה מרובה ושלא יפול לידיים הלא נכונות! כדי לסמן שהבנם, היכנסו אל תשובה ג והקישו את הסיסמא גג",
        "ג", listOf("א", "ב", "ד"), "גג", "מקום"
    ),
    MazeLevelEntity(
        "מה הצבע האהוב על מר קראב?", "כסף", listOf("ירוק", "אפור", "צהוב"), "pjyfnhhdlialeentirzvc", "מקום"
    ),
//    MazeLevelEntity(
//        "מה מהבאים אינו כלי נגינה (לפי תמנון מסויים)?",
//        "מיונז", listOf("קלרינט", "תופים", "גיטרה", "קטשופ"), "ellxvjacesitkxy"
//    ),
//    MazeLevelEntity(
//        "מאיפה סנדי במקור",
//        "טקסס", listOf("קולורדו", "ניו יורק", "קליפורניה", "אטלנטה", "פסיפי"), "wiemomshnlwtzhu,colzlxae"
//    ),
//    MazeLevelEntity(
//        "מה השם המלא של יוג'ין ה. קראב?", "יוג'ין ה. קראב",
//        listOf("אדוארד ל. קראב", "קראביליוס ק. קראב", "מר ג. קראב", "גרגמל פ. קראב", "קרמיט מ. הצפרדע"), "ntfei.lbqugt"
//    ),
//    MazeLevelEntity(
//        "מה הטייטל עבודה של בובספוג?",
//        "Vice Assistant General Manager of Certain Things",
//        listOf("קופאי", "Chef", "Driving Instructor", "Out of a job"),
//        "spdzzpxsfyalijgbqbvk,yip"
//    ),
//    MazeLevelEntity(
//        "איך קוראים לפארק שעשועים האהוב על בובספוג?",
//        "עולם הכפפה",
//        listOf("עולם הנייר", "עולם הגרב", "עולם הדלי", "עולם העולמות", "דיסני פארק"),
//        "vtaynkbscoltyilvy"
//    ),
//    MazeLevelEntity(
//        "מה קרה למר פאף?",
//        "אנשים הרגו אותו והפכו אותו למעטפת למנורה",
//        listOf("הוא פסדר", "מי?", "הוא מורה לנהיגה בבית ספר לנהיגה מתחרה"),
//        "aaikavrlphuidzzpx.Lvmalij"
//    ),
//    MazeLevelEntity(
//        "ישנם שלושה אנשים, אלקס בן וגרגמל. אחד אביר, אחד נוכל, ואחד מרגל. האביר תמיד דובר אמת, הנוכל תמיד שקרים, והמרגל מה שבא לו באותו הרגע. אלקס אומר: 'גרגמל נוכל'. בן אומר: 'אלקס אביר'. גרגמל אומר: 'אני המרגל'. מי האביר?",
//        "אלקס", listOf("בן", "גרגמל"), "wpkikxxyacG.Pj"
//    ),
//    MazeLevelEntity(
//        "איך קוראים למגזין שסקווידוויד קורא?",
//        "House Fancy",
//        listOf("Mansion Pretty", "Apartment Luscious", "Residence Inspiring"),
//        "yfnwytrestajldsrulvrRV"
//    ),
//    MazeLevelEntity(
//        "פטריק קרוב משפחה של מי?",
//        "גארי",
//        listOf("סקווידוויד", "בובספוג", "מר קראב", "פלנקטון", "פרל", "גברת פאף", "סנדי"),
//        "Wwegvlhrdgnax"
//    ),
//    MazeLevelEntity(
//        "יודעים מה, דוגרי אין לי כוח לחשוב על כל כך הרבה שאלות, קחו אחת חינם עליי היה לכם קשה עד כה 3>",
//        "תשובה נכונה",
//        listOf("לא", "לא2"),
//        "hvfvreryairkalstyxy,xh"
//    ),
//    MazeLevelEntity("ומי הנוכל?", "גרגמל", listOf("אלקס", "בן"), "vgkstyxzemv"),
//    MazeLevelEntity(
//        "איזה סוג חיה הוא סקווידוויד?",
//        "תמנון, בגלל איך שהפרצוף שלו נראה? זה נראה לכם הגיוני? וואטדהפאק _קוראים לו *סקוויד*וויד מה הולךךך",
//        listOf(
//            "דיונון, כי הוא *מתיז דיו*, אפילו שהפרצוף שלו נראה כמו כזה של תמנון מה שלא הגיוני למה שהוא יראה ככה למה הוא לא נראה כמו דיונון נורמלי מה הולךךךךך",
//            "ערפד",
//            "ספוג",
//            "כוכב ים",
//            "פלנקטון סבבה זה גם הגיוני כי יש לו צבע ירוק או משהו נו באמת אי אפשר כבר"
//        ),
//        "yvvtyxyiskhmxhvvvpoi"
//    ),
//    MazeLevelEntity(
//        "כמה זרועות יש לסקווידוויד?",
//        "6, אפילו שלתמנונים ולדיונונים יש 8, מה שלא הגיוני כי גם אם הוא איבד את הזרועות שלו אחת מהדברים על תמנונים ודיונונים זה שהם מגדלים זרועותתתתת אז כפרות מה הקטעעעע ",
//        listOf("8, דה הוא דיונון / תמנון חחחחח כמה רגליים יהיו לו בדיוק מה נראה לכם", "4", "2? כאילו, מה?"),
//        "l,fsuexlhtfmhoe:vtjlNkas"
//    ),
//    MazeLevelEntity(
//        "עייף אותי השאלות האלו. מה כאילו.. מה הכלי נגינה האהוב על סקווידוויד?",
//        "קלרינט",
//        listOf("מיונז", "תופים", "גיטרה", "פאקינג 6 אני לא מאמין", "קטשופ"),
//        "itkxysnkalVEU"
//    ),
//    MazeLevelEntity("ומי המרגל?", "בן", listOf("גרגמל", "אלקס", "אליס", "בוב", "ג'וני"), "ihkejxhgh((E+5)%10)elxtvkvre"),
//    MazeLevelEntity("באיזה מספר שאלה אנחנו?", "18", listOf("15", "16", "17", "19", "20"), "rvosfkalFLLXwegvllecy((G+3)%10)"),
//    MazeLevelEntity("מה השם משפחה של בובספוג?", "מכנס-מרובע", listOf("מכנס-עגול", "חולצה-מרובעת", "חולצה-עגולה"), "sitkxysnvtjlowmoiGIXLRprzlwaewALAKb"),
//    MazeLevelEntity("כמה מילים היו בפתיחה?", "71", listOf("68", "90", "83", "57", "43", "65"), "zcolkwesjpvvd.xhvhllvr!"),
//    MazeLevelEntity("אם מצפינים את כל הסיסמאות שהיו עד כה עם Vigenere על המילה ה27 בשיר האהוב על מה שמו, מקבלים משפט. זו החידה הבאה שלכם.", "ע", listOf("א", "ב"), "aaaa")
)